{"id":46,"date":"2021-12-01T11:10:53","date_gmt":"2021-12-01T11:10:53","guid":{"rendered":"https:\/\/www.maplemanorparking.net\/?page_id=46"},"modified":"2022-03-08T12:10:07","modified_gmt":"2022-03-08T12:10:07","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"<p>Terms &amp; Conditions<\/p>\n<p>&nbsp;<\/p>\n<p>Please read these Terms and Conditions carefully before handing over your key.  We&#8217;ve tried to make them short and as easy to read and understand as possible. They apply only to direct bookings, not where a booking is made through a third party which has sub-contracted its obligations to us or which acts as our agent.<\/p>\n<p><strong> 1) Your rights and responsibilities:<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<ul>\n<li>Please refer to the email you receive from us acknowledging your booking for details of collection and delivery procedures. It is important that you follow these closely. If in doubt call 03333 222 333 for assistance.<\/li>\n<li>Make sure your vehicle is in a roadworthy, safe and legal condition with full insurance, road tax and MOT.<\/li>\n<li>On arrival at the airport, our car park, or your hotel (as the case may be) you must:<\/li>\n<li>comply with any instructions or advice given by authorised persons or signage with regard to making available your car for photographic inspection, routes which are to be followed to the designated drop-off area and parking bays which are to be used including, where there is a CCTV inspection bay present (which will be clearly signposted), following the instructions displayed at its entrance.<\/li>\n<li>remove your luggage and any personal possessions which you may need for your trip from your vehicle. Your personal possessions and luggage are your responsibility at all times.<\/li>\n<li>present your email confirmation (or quote your booking reference) to our representative (or hotel reception).<\/li>\n<li>hand your vehicle key and the car park entry ticket issued at the barrier (if any) to our representative. Please remove house keys etc. Tell us about any non-standard vehicle immobiliser or security features.<\/li>\n<li>On your return to the UK please follow the procedures referred to in paragraph 1 a) above. Then, once you have made contact with our representative, you must:<\/li>\n<li>produce the bar-coded card you were given when your car was left with us. You may be asked for proof of identity. We may refuse to hand over the vehicle if you can not establish to our reasonable satisfaction that you are entitled to it.<\/li>\n<li>pay any supplementary parking charge and any valeting charges or electric vehicle charging fees due (see 2 c) below).<\/li>\n<li>inspect your vehicle and report any damage to our representative <strong>before you leave<\/strong>. Failure to do so may prejudice subsequent claims.<\/li>\n<\/ul>\n<p><strong> 2) Our rights and responsibilities:<\/strong><\/p>\n<p>a) We will take all reasonable care of your vehicle for the period you have booked and paid for, starting from when you give us your key, or from when we collect your key, if you have left it with a third party such as a hotel receptionist.<\/p>\n<p>b) If you park for longer than the period you have booked for, we will charge you for the extra days at the full daily price that applies at the time and if you have not claimed your vehicle within a reasonable time after the end of your booked period or contacted us to agree a new arrangement we can regard your vehicle as having been abandoned. We may then make arrangements for its disposal to cover our costs (but we will take reasonable steps to contact you before doing so) in accordance with the Torts (Interference with Goods) Act 1977. There are no refunds for early returns.<\/p>\n<p>c) We may retain your vehicle until you have paid the full amount due (including valeting charges and electric vehicle charging fees)<\/p>\n<p>Although we will generally keep your car at the same secure compound for the duration of the booking period we may move vehicles if we need to and reserve the right to move vehicles to our overflow car parks elsewhere in the vicinity. During our normal operations our drivers may carry other members of our staff with them for training or logistical reasons. All our drivers are fully insured against any damage which may be caused to your vehicle on the public highway, subject to the exceptions referred to in paragraph 3 below. Whilst your vehicle is in a public or hotel car park or in any of our compounds however, then unless we accept liability for any loss or damage in accordance with paragraph 3 below, you must rely on your own vehicle insurance policy.<\/p>\n<p><strong> 3) We are not responsible for the following:<\/strong><\/p>\n<p>a) Insurance cover for you, your vehicle, or its contents, except for your vehicle when being driven by our drivers on the public highway.b) Damage to your vehicle, including windscreens, wing mirrors, aerials, punctures, wheel scuffs, chip marks, minor scratches and dents, mechanical or electrical failure and the consequences thereof, or events beyond our control, or any loss or theft of or damage to the vehicle’s contents unless such damage loss or theft arises as a result of our negligence or our failure to take reasonable care of your vehicle. Note in particular the additional provisions below concerning valeting and electric vehicle charging.<\/p>\n<p>c) Matters that are covered by your car, holiday, household, motor or any other more specific insurance. You must look to that cover for protection in the first instance.<\/p>\n<p>d) The direct or indirect consequences of force majeure, terrorism, catastrophe, adverse weather, industrial action, cancellation of flights, loss of baggage, traffic conditions, vandalism, failure of third parties to comply with their obligations to you (whether contractual statutory or otherwise) or criminal activity of any description.<\/p>\n<p>e) Any natural deterioration in the vehicle&#8217;s condition while it is with us.Property left unattended in your vehicle, on our site or in courtesy vehicles and trailers.<\/p>\n<p>Any consequential (indirect) losses including but not limited to the cost of car hire, hotels, meals, or other expenses incurred by you.<br \/>\nDelays due to incorrect information being provided to us by you.<\/li>\n<\/ol>\n<p><strong>Despite the above, we will always accept liability for death or injury caused by our negligence. <\/strong><\/p>\n<p><strong>If we are negligent, or otherwise in breach of our obligations to you, then our liability will extend only to the loss or damage which flows directly from that negligence or breach and which is a reasonably foreseeable consequence of it.<\/strong><\/p>\n<p><strong> 4) Claims:<\/strong><\/p>\n<p>Should you wish to make a claim against us for damage to your vehicle then:<\/p>\n<p>a) wherever practicable we must be given a reasonable opportunity to inspect the alleged damage before it is repaired: in any event you must send us photographic evidence of the damage and any parts replaced must be retained for our inspection. Copies of the photographs of your vehicle which we take when we first receive it can be made available to you at a cost of £50 which we will re-imburse if your claim succeeds.<\/p>\n<p>b) we may require you, at your own expense, to have your claim assessed by an independent expert nominated by us. You and we will both be entitled to a copy of the expert’s report. Should your claim succeed, we will re-imburse you for the expert’s fees.<\/p>\n<p>c) if we accept liability for damage to your vehicle then we may require that the repairs are undertaken by our own contractors or by contractors approved by us. We may elect to provide you with a courtesy car while those repairs are undertaken. Under no circumstances will we accept liability for the cost of repairs undertaken by third parties, or for the cost of car hire arranged by them or by you, without our prior written approval.<\/p>\n<p><strong>The limitations set out in clauses 3 and 4 above do not affect your rights and remedies in the event of any loss or damage caused to your vehicle by the intentional act or omission of any member of our staff.<\/strong><\/p>\n<p><strong> 5) Privacy:<\/strong><\/p>\n<p>We collect and record information about you to enable us to provide you with the best possible service, and to enable us to process your booking. We will only use the information that we collect about you lawfully in accordance with the General Data Protection Regulation and the Data Protection Act 2018.<\/p>\n<p>We will not use this information to contact you for marketing purposes, should you ask us not to do so and we will not share your information with any other organisations.<\/p>\n<p>If you have any questions\/comments about privacy or if you wish to know what information we hold about you please email us at datacontroller@mapleparking.co.uk. If you find any inaccuracies, we will do our best to delete or correct them promptly.<\/p>\n<p><strong> 6) Prices:<\/strong><\/p>\n<p>We do adjust our prices from time to time. We recommend you visit our web site for the most up-to-date prices. All prices include VAT at the current rate.<\/p>\n<p><strong> 7) Cancellation:<\/strong><\/p>\n<p>Under the Consumer Contracts (Information, Cancellation and Additional Charges) Regulations 2013, you have 14 days to cancel your booking, starting from the day after we confirm it.  If you cancel within that period you will be refunded all charges that you have paid to us unless you cancel after the booking period begins (i.e. at any time after the pre-booked arrival time or, in relation to some “meet and greet” services, after we dispatch our driver to come and collect your vehicle from you, if sooner) in which case you will remain liable for our charges for each day or part day from then up to and including the date when cancellation takes effect.<\/p>\n<p>We will still accept cancellations after the expiry of this 14 day period and refund all charges provided at least 24 hours’ notice is given, but a £10.00 administration charge may be levied and deducted from the refunded amount in certain circumstances at our discretion. For bookings cancelled after expiry of the 14 day period and less than 24 hours before the booking period begins we will issue a credit note which can be used as part payment for any booking made with us within 180 days of cancellation. We will not be liable to refund any unused portion of any credit note and you will have to pay any excess if the parking charge for the new booking exceeds the amount of the credit note. No refunds or credits will be given for cancellations less than 24 hours before the booking period begins. In the event that we adopt a specific policy covering bookings affected by any global pandemic or similar event affecting the ability of passengers to travel generally to or from a particular country, which is announced on our website, that policy will override the provisions set out above.<\/p>\n<p>Cancellations should be made, preferably by email to bookings@mapleparking.co.uk or by post addressed to us at London Road, Crawley, West Sussex RH10 9SW. Cancellation notices must include your full name, booking reference and the start date and time of the booking you wish to cancel. They are only valid once received by us and take effect on the date of receipt. A model form of cancellation, which will automatically generate an email to us when you hit “Submit&#8221; is available through the following link:  https:\/\/www.mapleparking.co.uk\/cancellations\/.<\/p>\n<p><strong> 8) Restricted Vehicles:<\/strong><\/p>\n<p>We can accept some nonstandard sized vehicles such as motorhomes, vehicles with trailers or commercial vehicles but only by special prior arrangement. Additional charges will apply to all vehicles which do not fit in a standard size parking bay. Please contact us in advance for details.<\/p>\n<p>We regret that we may not be able to accept vehicles which have been specially adapted to meet the needs of disabled users. Please contact us in advance to check this if you are in any doubt.<\/p>\n<p><strong> 9) Valeting Services:<\/strong><\/p>\n<p>The following (additional) terms and conditions apply when you book \/ use our valeting services.<\/p>\n<p>a) Cars are accepted for valeting subject to availability of the service. If for any reason we are unable to (or fail) to valet your car then your sole remedy shall be to a full refund or rebate of any monies paid or agreed to be paid by you for such service.<\/p>\n<p>b) Our current prices are listed on our service menu, a copy of which was shown or provided to you at the time of booking. Our determination of the size category of your vehicle with regard to the price list shall be final and binding. Although we will always apply the prices current at the time of booking, we reserve the right to change pricing generally without prior notice.<\/p>\n<p>c) Unless paid for in advance, payment is due when we return your vehicle to you. Please note the provisions of paragraph 2c).<\/p>\n<p>d) You must disclose to us all defects, damage, or weakness in your vehicle, known or suspected by you, which may be affected by the services prior to our commencing the cleaning process. We will use a pressure washer to clean your vehicle. Pressure washers remove dirt, grit <u>AND LOOSE DAMAGED OR POORLY APPLIED PAINTWORK. <\/u>If your vehicle’s paintwork is compromised in any way, not to the manufacturer’s specification, stone chipped, cracked, crazed, damaged or substandard, pressure washing may make it worse. Decals may be lifted. We do not accept any liability for damage caused by pressure washing.<\/p>\n<p>e) We will clean round any child seats and booster seats unless you remove them. If you do so then they must be refitted by you. We will not be able to remove or refit seats under any circumstances.<\/p>\n<p><strong> 10) Electric vehicle charging services:<\/strong><\/p>\n<p>The following (additional) terms and conditions apply when you book \/ use our electric vehicle charging services.<\/p>\n<p>Cars are accepted for charging subject to availability of the service. If for any reason we are unable (or fail) to charge your car then your sole remedy shall be to a full refund or rebate of any monies paid or agreed to be paid by you for such service.<\/p>\n<p>Unless paid for in advance, payment is due when we return your vehicle to you. Please note the provisions of paragraph 2c)<\/p>\n<p>Last Updated 01.12.2021<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms &amp; Conditions &nbsp; Please read these Terms and Conditions carefully before handing over your key.  We&#8217;ve tried to make them short and as easy to read and understand as possible. They apply only to direct bookings, not where a booking is made through a third party which has sub-contracted its obligations to us or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Meet and Greet Terms &amp; Conditions - Maple Parking\" \/>\n<meta property=\"og:description\" content=\"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Maple Parking\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-08T12:10:07+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.mapleparking.co.uk\/#website\",\"url\":\"https:\/\/www.mapleparking.co.uk\/\",\"name\":\"Maple Parking\",\"description\":\"Meet &amp; Greet Parking in Just 3 Easy Steps!\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.mapleparking.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#webpage\",\"url\":\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/\",\"name\":\"Meet and Greet Terms & Conditions - Maple Parking\",\"isPartOf\":{\"@id\":\"https:\/\/www.mapleparking.co.uk\/#website\"},\"datePublished\":\"2021-12-01T11:10:53+00:00\",\"dateModified\":\"2022-03-08T12:10:07+00:00\",\"description\":\"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.mapleparking.co.uk\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms &#038; Conditions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"description":"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/","og_locale":"en_GB","og_type":"article","og_title":"Meet and Greet Terms & Conditions - Maple Parking","og_description":"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.","og_url":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/","og_site_name":"Maple Parking","article_modified_time":"2022-03-08T12:10:07+00:00","twitter_card":"summary","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.mapleparking.co.uk\/#website","url":"https:\/\/www.mapleparking.co.uk\/","name":"Maple Parking","description":"Meet &amp; Greet Parking in Just 3 Easy Steps!","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.mapleparking.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"WebPage","@id":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#webpage","url":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/","name":"Meet and Greet Terms & Conditions - Maple Parking","isPartOf":{"@id":"https:\/\/www.mapleparking.co.uk\/#website"},"datePublished":"2021-12-01T11:10:53+00:00","dateModified":"2022-03-08T12:10:07+00:00","description":"These terms and conditions refer to car park bookings made directly with Maple Parking, either meet and greet parking or park and ride.","breadcrumb":{"@id":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.mapleparking.co.uk\/terms-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.mapleparking.co.uk\/terms-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.mapleparking.co.uk\/"},{"@type":"ListItem","position":2,"name":"Terms &#038; Conditions"}]}]}},"_links":{"self":[{"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/pages\/46"}],"collection":[{"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/comments?post=46"}],"version-history":[{"count":29,"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/pages\/46\/revisions"}],"predecessor-version":[{"id":4729,"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/pages\/46\/revisions\/4729"}],"wp:attachment":[{"href":"https:\/\/www.mapleparking.co.uk\/wp-json\/wp\/v2\/media?parent=46"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}